1s/ERP/Conf/Enums/Лико_ТипыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОпределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамоклеящаясяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВплавляемаяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Термоусадка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полуфабрикат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолуфабрикатПодАппликатор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыЭтикеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КЭ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кльр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/CommonModules/Лико_ОпределениеТипаПродукции/Ext/Module.bsl
//+Лико m.shenderov 12.05.2026
// Функции для определения типа заказа, типа этикетки и категории продукции по наименованию

#Область ПрограммныйИнтерфейс

// Определяет тип заказа, тип этикетки и категорию продукции по наименованию
//
// Параметры:
//  Наименование - Строка - наименование продукции из таблицы заказов
//
// Возвращаемое значение:
//  Структура - содержит:
//    * ТипЗаказа - ПеречислениеСсылка.Лико_ТипыЗаказов
//    * ТипЭтикетки - ПеречислениеСсылка.Лико_ТипыЭтикеток
//    * КатегорияПродукции - Строка - категория продукции (Напитки, Масла, БАДы, Косметика и т.д.)
//
Функция ОпределитьТипПродукции(Наименование) Экспорт
    
    Результат = Новый Структура("ТипЗаказа, ТипЭтикетки, КатегорияПродукции");
    
    // Приводим к верхнему регистру для поиска
    НаименованиеВерх = ВРег(СокрЛП(Наименование));
    
    // === ОПРЕДЕЛЕНИЕ ТИПА ЗАКАЗА ===
    Результат.ТипЗаказа = ОпределитьТипЗаказа(НаименованиеВерх);
    
    // === ОПРЕДЕЛЕНИЕ ТИПА ЭТИКЕТКИ ===
    Результат.ТипЭтикетки = ОпределитьТипЭтикетки(НаименованиеВерх);
    
    // === ОПРЕДЕЛЕНИЕ КАТЕГОРИИ ПРОДУКЦИИ ===
    Результат.КатегорияПродукции = ОпределитьКатегориюПродукции(НаименованиеВерх);
    
    Возврат Результат;
    
КонецФункции

// Определяет только тип заказа по наименованию
//
// Параметры:
//  Наименование - Строка - наименование продукции (верхний регистр)
//
// Возвращаемое значение:
//  ПеречислениеСсылка.Лико_ТипыЗаказов
//
Функция ОпределитьТипЗаказа(НаименованиеВерх) Экспорт
    
    // Термоусадка
    Если СтрНайти(НаименованиеВерх, "ТЕРМОУСАДК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, " ТУ ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ТЕРМОУСАДОЧН") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЗаказов.Термоусадка;
        
    // Пакеты
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПАКЕТ") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЗаказов.Пакеты;
        
    // Упаковка (коробки, пачки и т.д.)
    ИначеЕсли СтрНайти(НаименованиеВерх, "УПАКОВК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КОРОБК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПАЧК") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЗаказов.Упаковка;
        
    // Полуфабрикат
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПОЛУФАБРИКАТ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, " ПФ ") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЗаказов.Полуфабрикат;
        
    // Вплавляемая этикетка
    ИначеЕсли СтрНайти(НаименованиеВерх, "ВПЛАВЛЯЕМ") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЗаказов.ВплавляемаяЭтикетка;
        
    // По умолчанию - Самоклеящаяся этикетка
    Иначе
        Возврат Перечисления.Лико_ТипыЗаказов.СамоклеящаясяЭтикетка;
    КонецЕсли;
    
КонецФункции

// Определяет только тип этикетки по наименованию
//
// Параметры:
//  Наименование - Строка - наименование продукции (верхний регистр)
//
// Возвращаемое значение:
//  ПеречислениеСсылка.Лико_ТипыЭтикеток
//
Функция ОпределитьТипЭтикетки(НаименованиеВерх) Экспорт
    
    // Контрэтикетка
    Если СтрНайти(НаименованиеВерх, "КОНТРЭТИКЕТК") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЭтикеток.КЭ;
        
    // Кольеретка
    ИначеЕсли СтрНайти(НаименованиеВерх, "КОЛЬЕРЕТК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КЛЬР") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЭтикеток.Кльр;
        
    // Комплект
    ИначеЕсли СтрНайти(НаименованиеВерх, "КОМПЛЕКТ") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЭтикеток.Комплект;
        
    // Пакет
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПАКЕТ") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЭтикеток.Пакет;
        
    // Полуфабрикат
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПОЛУФАБРИКАТ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, " ПФ ") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЭтикеток.ПФ;
        
    // Флоупак
    ИначеЕсли СтрНайти(НаименованиеВерх, "ФЛОУПАК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, " ФЛ ") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЭтикеток.ФЛ;
        
    // Покрывная пленка
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПОКРЫВН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, " ПП ") > 0 Тогда
        Возврат Перечисления.Лико_ТипыЭтикеток.ПП;
        
    // По умолчанию - Этикетка
    Иначе
        Возврат Перечисления.Лико_ТипыЭтикеток.ЭТ;
    КонецЕсли;
    
КонецФункции

// Возвращает строковое представление типа продукции для отладки
//
// Параметры:
//  Наименование - Строка - наименование продукции
//
// Возвращаемое значение:
//  Строка - описание определенных типов
//
Функция ПредставлениеТипаПродукции(Наименование) Экспорт
    
    Типы = ОпределитьТипПродукции(Наименование);
    
    Возврат СтрШаблон("Тип заказа: %1, Тип этикетки: %2",
        Типы.ТипЗаказа,
        Типы.ТипЭтикетки);
        
КонецФункции

// Определяет конкретный тип продукции по наименованию
//
// Параметры:
//  Наименование - Строка - наименование продукции (верхний регистр)
//
// Возвращаемое значение:
//  Строка - конкретный тип продукции
//
Функция ОпределитьКатегориюПродукции(НаименованиеВерх) Экспорт
    
    // Алкогольные напитки
    Если СтрНайти(НаименованиеВерх, "ШАМПАНСК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ШАМПАНЬСК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПРОСЕККО") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "АСТИ") > 0 Тогда
        Возврат "Шампанское и игристые вина";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ВИНО") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ВИНА") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "МУСКАТ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КАБЕРНЕ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "МЕРЛО") > 0 Тогда
        Возврат "Вина";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПИВО") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПИВА") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЛАГЕР") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "АЛЕ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СТАУТ") > 0 Тогда
        Возврат "Пиво";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ВОДК") > 0 Тогда
        Возврат "Водка";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "КОНЬЯК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "БРЕНДИ") > 0 Тогда
        Возврат "Коньяк и бренди";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ЛИКЕР") > 0 Тогда
        Возврат "Ликеры";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "НАСТОЙК") > 0 Тогда
        Возврат "Настойки";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ДЖИН") > 0 Тогда
        Возврат "Джин";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "РОМ") > 0 Тогда
        Возврат "Ром";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ТЕКИЛА") > 0 Тогда
        Возврат "Текила";
        
    // Безалкогольные напитки
    ИначеЕсли СтрНайти(НаименованиеВерх, "СОК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "НЕКТАР") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "МОРС") > 0 Тогда
        Возврат "Соки и нектары";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ВОДА") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "МИНЕРАЛЬН") > 0 Тогда
        Возврат "Вода";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ГАЗИРОВК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЛИМОНАД") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КОЛА") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СПРАЙТ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ФАНТА") > 0 Тогда
        Возврат "Газированные напитки";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ЭНЕРГЕТИК") > 0 Тогда
        Возврат "Энергетические напитки";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ЧАЙ") > 0 Тогда
        Возврат "Чай";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "КОФЕ") > 0 Тогда
        Возврат "Кофе";
        
    // Масла и автохимия
    ИначеЕсли СтрНайти(НаименованиеВерх, "МАСЛ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "МОТОРН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ТРАНСМИССИОН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ГИДРАВЛИЧЕСК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "АНТИФРИЗ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ТОРМОЗН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ОХЛАЖДАЮЩ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "SINTEC") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "MOBIL") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "SHELL") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "CASTROL") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ZIC") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЛУКОЙЛ") > 0 Тогда
        Возврат "Масла и автохимия";
        
    // БАДы и лекарства
    ИначеЕсли СтрНайти(НаименованиеВерх, "БАД") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ТАБЛЕТК") > 0
        ИЛИ СтрНайти(КАПСУЛ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПОРОШК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СИРОП") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "МАЗЬ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ГЕЛЬ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КРЕМ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "РАСТВОР") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СУСПЕНЗИ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЭКСТРАКТ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ВИТАМИН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КОМПЛЕКС") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "CORDY") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ИММУНИТЕТ") > 0 Тогда
        Возврат "БАДы и лекарства";
        
    // Косметика
    ИначеЕсли СтрНайти(НаименованиеВерх, "ШАМПУН") > 0 Тогда
        Возврат "Шампунь";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "КОНДИЦИОНЕР") > 0 Тогда
        Возврат "Кондиционер для волос";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "МАСК") > 0
        И СтрНайти(НаименованиеВерх, "ВОЛОС") > 0 Тогда
        Возврат "Маска для волос";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "КРЕМ") > 0
        И (СтрНайти(НаименованиеВерх, "ЛИЦА") > 0
            ИЛИ СтрНайти(НаименованиеВерх, "РУК") > 0
            ИЛИ СтрНайти(НаименованиеВерх, "ТЕЛА") > 0) Тогда
        Возврат "Крем";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ЛОСЬОН") > 0 Тогда
        Возврат "Лосьон";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "СКРАБ") > 0 Тогда
        Возврат "Скраб";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ДЕЗОДОРАНТ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "АНТИПЕРСПИРАНТ") > 0 Тогда
        Возврат "Дезодорант";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПАРФЮМ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ТУАЛЕТН") > 0 Тогда
        Возврат "Парфюмерия";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "МЫЛО") > 0 Тогда
        Возврат "Мыло";
        
    // Бытовая химия
    ИначеЕсли СтрНайти(НаименованиеВерх, "СТИРАН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПРАН") > 0 Тогда
        Возврат "Средства для стирки";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПОСУД") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПОСУДОМ") > 0 Тогда
        Возврат "Средства для посуды";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПОЛ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПОЛОВ") > 0 Тогда
        Возврат "Средства для пола";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "УБОРК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "УБИРАН") > 0 Тогда
        Возврат "Средства для уборки";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "СПРЕЙ") > 0
        И СтрНайти(НаименованиеВерх, "POLYMER") > 0 Тогда
        Возврат "Средства для ухода";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "IMMULEX") > 0 Тогда
        Возврат "Спрей для полости рта";
        
    // Клей и герметики
    ИначеЕсли СтрНайти(НаименованиеВерх, "КЛЕЙ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КЛЕЯ") > 0 Тогда
        Возврат "Клей";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ГЕРМЕТИК") > 0 Тогда
        Возврат "Герметик";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "МАСТИК") > 0 Тогда
        Возврат "Мастика";
        
    // Автохимия и масла
    ИначеЕсли СтрНайти(НаименованиеВерх, "МАСЛ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "SINTEC") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "MOBIL") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "SHELL") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "CASTROL") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ZIC") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЛУКОЙЛ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "МОТОРН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ТРАНСМИССИОН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ГИДРАВЛИЧЕСК") > 0 Тогда
        Возврат "Масла";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "АНТИФРИЗ") > 0 Тогда
        Возврат "Антифриз";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ТОРМОЗН") > 0 Тогда
        Возврат "Тормозная жидкость";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ОХЛАЖДАЮЩ") > 0 Тогда
        Возврат "Охлаждающая жидкость";
        
    // Аккумуляторы и запчасти
    ИначеЕсли СтрНайти(НаименованиеВерх, "АККУМУЛЯТОР") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "БАТАРЕЙ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "EFB") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЗВЕРЬ") > 0 Тогда
        Возврат "Аккумуляторы";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ФИЛЬТР") > 0 Тогда
        Возврат "Фильтры";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ЗАПЧАСТ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ДЕТАЛ") > 0 Тогда
        Возврат "Запчасти";
        
    // Продукты питания
    ИначеЕсли СтрНайти(НаименованиеВерх, "МОЛОК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КЕФИР") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СМЕТАН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЙОГУРТ") > 0 Тогда
        Возврат "Молочные продукты";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "СЫР") > 0 Тогда
        Возврат "Сыры";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "МЯС") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КОЛБАС") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СОСИС") > 0 Тогда
        Возврат "Мясные продукты";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "РЫБ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КОНСЕРВ") > 0
        И СтрНайти(НаименованиеВерх, "РЫБН") > 0 Тогда
        Возврат "Рыбные продукты";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "МАСЛ") > 0
        И СтрНайти(НаименованиеВерх, "ПИЩЕВ") > 0 Тогда
        Возврат "Масло пищевое";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "СОУС") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КЕТЧУП") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "МАЙОНЕЗ") > 0 Тогда
        Возврат "Соусы";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПРИПРАВ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СПЕЦИ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СОЛЬ") > 0 Тогда
        Возврат "Приправы и специи";
        
    // Бытовая техника
    ИначеЕсли СтрНайти(НаименованиеВерх, "ТЕЛЕФОН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "СМАРТФОН") > 0 Тогда
        Возврат "Телефоны";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПЛАНШЕТ") > 0 Тогда
        Возврат "Планшеты";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ТЕЛЕВИЗОР") > 0 Тогда
        Возврат "Телевизоры";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ХОЛОДИЛЬНИК") > 0 Тогда
        Возврат "Холодильники";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "СТИРАЛЬН") > 0 Тогда
        Возврат "Стиральные машины";
        
    ИначеЕсли СтрНайти(НаименованиеВерх, "ПЫЛЕСОС") > 0 Тогда
        Возврат "Пылесосы";
        
    // Строительные материалы
    ИначеЕсли СтрНайти(НаименованиеВерх, "БЕТОН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЦЕМЕНТ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "КРАСК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ЛАК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ШТУКАТУР") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПЛИТК") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПРОФИЛ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ПЕН") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "УТЕПЛИТЕЛ") > 0
        ИЛИ СтрНайти(НаименованиеВерх, "ИЗОЛЯЦИ") > 0 Тогда
        Возврат "Строительные материалы";
        
    // По умолчанию
    Иначе
        Возврат "Прочее";
    КонецЕсли;
    
КонецФункции

#КонецОбласти
